# CustomExporter Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CustomExporter Methods
CustomExporter Class See Also
---
The CustomExporter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Export(IList<(Of <<'(ElementId>)>>)) | Exports a collection of 3D or 2D views |
| Export(View) | Exports one 3D or 2D view |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsRenderingSupported | Checks if view rendering is currently supported in the running instance of Revit. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
CustomExporter Class
Autodesk.Revit.DB Namespace